Autodesk.Revit.DB.PointOnCurveMeasurementType
Point on curve measurement type
Defines the types of measurements that may be used when placing a point at a designated distance along a curve.
Since:
2012
Since:
2012

Autodesk.Revit.DB.PointOnCurveMeasurementType.Angle
Angle - defined only for arc and circle.
It is the angle subtended at the center by the portion of the curve from the star to the given point.

Autodesk.Revit.DB.PointOnCurveMeasurementType.ChordLength
Chord length = length of the chord (line segment) joining the start point and the given point.
Also known as 3D distance

Autodesk.Revit.DB.PointOnCurveMeasurementType.NormalizedSegmentLength
Normalized segment length.
It is defined for curves with user defined bounds or natural bounds.
It is measured as the fraction of the segment length over the total length of the curve.
Its value varies between 0 and 1. 0 corresponds to the start and 1 corresponds to the end.

Autodesk.Revit.DB.PointOnCurveMeasurementType.SegmentLength
Length of the curve segment between the start point and the given point.

Autodesk.Revit.DB.PointOnCurveMeasurementType.NormalizedCurveParameter
Normalized value of the curve parameter.
It is defined for curves with user defined bounds or natural bounds, start and end.
It is measured as the fraction of the curve parameter (t) over the total parametric range = (t-start) / (end-start).
Its value varies between 0 and 1. 0 corresponds to the start and 1 corresponds to the end.

Autodesk.Revit.DB.PointOnCurveMeasurementType.NonNormalizedCurveParameter
The non-normalized (actual) curve parameter value of the given point.
The curve parameter is the defining parameter of the curve.
It is also known as the raw/natural parameter.